LIST IN  DICTIONARY

In [1]:
students={
    "name":["vimal","abhi","rahul"],
    "remarks":["okk","good","vgood"],
    "mob":[1111,2222,3333]
}

In [2]:
students

{'name': ['vimal', 'abhi', 'rahul'],
 'remarks': ['okk', 'good', 'vgood'],
 'mob': [1111, 2222, 3333]}

In [7]:
students["name"][1],students["remarks"][1],students["mob"][1]

('abhi', 'good', 2222)

in list we can do rowwise but not column wise and viseaversa in dictionary

In [8]:
import pandas

In [10]:
mydb=pandas.DataFrame(students)

In [11]:
mydb

    name remarks   mob
0  vimal     okk  1111
1   abhi    good  2222
2  rahul   vgood  3333

for column vise

In [12]:
mydb["name"]

0    vimal
1     abhi
2    rahul
Name: name, dtype: object

In [13]:
mydb[["name","remarks"]]

    name remarks
0  vimal     okk
1   abhi    good
2  rahul   vgood

for rowwise op

we use loc[]

In [14]:
mydb.loc[0]

name       vimal
remarks      okk
mob         1111
Name: 0, dtype: object

In [16]:
mydb.loc[[0,1]]

    name remarks   mob
0  vimal     okk  1111
1   abhi    good  2222